modm-ext/data.modm.io/docs/svd/header_stm32wl3xx.svd
        <register>
          <name>TDR</name>
          <description>(@ 0x00000028) Transmit data register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TDR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESC</name>
          <description>(@ 0x0000002C) Prescaler register</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PRESCALER</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>Input clock not divided</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Input clock divided by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Input clock divided by 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV6</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Input clock divided by 8</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV10</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV12</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>Input clock divided by 32</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC1</name>
      <description>ADC (ADC)</description>
      <groupName>ADC</groupName>
      <baseAddress>0x41006000</baseAddress>
      <interrupt>
        <name>ADC</name>
        <description>12 ADC interrupt</description>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>VERSION_ID</name>
          <description>(@ 0x00000000) VERSION_ID register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VERSION_ID</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF</name>
          <description>(@ 0x00000004) ADC configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CONT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEQUENCE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEQ_LEN</name>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SMPS_SYNCHRO_ENA</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAMPLE_RATE_LSB</name>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SAMPLE_RATE</name>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DMA_DS_ENA</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVR_DS_CFG</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOST</name>
                  <description>Previous data is preserved, new data is lost.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEPT</name>
                  <description>Previous data is overwritten, new data is kept.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIT_INVERT_SN</name>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIT_INVERT_DIFF</name>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC_CONT_1V2</name>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>START</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>END</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLE_RATE_MSB</name>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>(@ 0x00000008) ADC control register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADC_ON_OFF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START_CONV</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STOP_OP_MODE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWITCH</name>
          <description>(@ 0x00000014) ADC switch control for Input Selection</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SE_VIN_0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SE_VIN_1</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SE_VIN_2</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SE_VIN_3</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SE_VIN_4</name>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SE_VIN_5</name>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SE_VIN_6</name>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>SE_VIN_7</name>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DS_CONF</name>
          <description>(@ 0x0000001C) Downsampler configuration register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DS_RATIO</name>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RATIO_1</name>
                  <description>ADC Down Sampler ratio 1, no down sampling (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATIO_2</name>
                  <description>ADC Down Sampler ratio 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATIO_4</name>
                  <description>ADC Down Sampler ratio 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATIO_8</name>
                  <description>ADC Down Sampler ratio 8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATIO_16</name>
                  <description>ADC Down Sampler ratio 16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATIO_32</name>
                  <description>ADC Down Sampler ratio 32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATIO_64</name>
                  <description>ADC Down Sampler ratio 64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATIO_128</name>
                  <description>ADC Down Sampler ratio 128</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DS_WIDTH</name>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQ_1</name>
          <description>(@ 0x00000020) ADC regular sequence programming register 1</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEQ0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SEQ1</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SEQ2</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SEQ3</name>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SEQ4</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SEQ5</name>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SEQ6</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SEQ7</name>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQ_2</name>
          <description>(@ 0x00000024) ADC regular sequence programming register 2</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEQ8</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SEQ9</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SEQ10</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SEQ11</name>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SEQ12</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SEQ13</name>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SEQ14</name>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>SEQ15</name>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_1</name>
          <description>(@ 0x00000028) ADC Gain &amp;</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GAIN1</name>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>OFFSET1</name>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_2</name>
          <description>(@ 0x0000002C) ADC Gain &amp;</description>
          <addressOffset>0x2c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GAIN2</name>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>OFFSET2</name>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_3</name>
          <description>(@ 0x00000030) ADC Gain &amp;</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GAIN3</name>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>OFFSET3</name>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_4</name>
          <description>(@ 0x00000034) ADC Gain &amp;</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GAIN4</name>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>OFFSET4</name>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP_SEL</name>
          <description>(@ 0x00000038) ADC Gain &amp;</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OFFSET_GAIN0</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OFFSET_GAIN1</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OFFSET_GAIN2</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OFFSET_GAIN3</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OFFSET_GAIN4</name>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OFFSET_GAIN5</name>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OFFSET_GAIN6</name>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OFFSET_GAIN7</name>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>OFFSET_GAIN8</name>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WD_TH</name>
          <description>(@ 0x0000003C) ADC watchdog threshold register register</description>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WD_LT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>WD_HT</name>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WD_CONF</name>
          <description>(@ 0x00000040) ADC watchdog configuration register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AWD_CHX</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VINM0</name>
                  <description>ADC watchdog channel selection: VINM0 to negative input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VINM1</name>
                  <description>ADC watchdog channel selection: VINM1 to negative input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VINM2</name>
                  <description>ADC watchdog channel selection: VINM2 to negative input</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VINM3</name>
                  <description>ADC watchdog channel selection: VINM3 to negative input</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MICROM</name>
                  <description>ADC watchdog channel selection: MICROM to negative input</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBAT</name>
                  <description>ADC watchdog channel selection: VBAT to negative input</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND_NEG</name>
                  <description>ADC watchdog channel selection: GND to negative input</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDA_NEG</name>
                  <description>ADC watchdog channel selection: VDDA to negative input</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VINP0</name>
                  <description>ADC watchdog channel selection: VINP0 to positive input</description>
                  <value>256</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VINP1</name>
                  <description>ADC watchdog channel selection: VINP1 to positive input</description>
                  <value>512</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VINP2</name>
                  <description>ADC watchdog channel selection: VINP2 to positive input</description>
                  <value>1024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VINP3</name>
                  <description>ADC watchdog channel selection: VINP3 to positive input</description>
                  <value>2048</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MICROP</name>
                  <description>ADC watchdog channel selection: MICROP to positive input</description>
                  <value>4096</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSENSOR</name>
                  <description>ADC watchdog channel selection: TEMP to positive input</description>
                  <value>8192</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND_POS</name>
                  <description>ADC watchdog channel selection: GND to positive input</description>
                  <value>16384</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDA_POS</name>
                  <description>ADC watchdog channel selection: VDDA to positive input</description>
                  <value>32768</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
