modm-ext/data.modm.io/docs/svd/header_stm32wl3xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MR_SUBG_GLOB_MISC</name>
      <description>MR_SUBG Global Misc</description>
      <groupName>MR_SUBG_GLOB_MISC</groupName>
      <baseAddress>0x49000700</baseAddress>
      <registers>
        <register>
          <name>RFIP_VERSION</name>
          <description>(@ 0x00000000) RFIP_VERSION register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REVISION</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>VERSION</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PRODUCT</name>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RRM_UDRA_CTRL</name>
          <description>(@ 0x00000004) RRM_UDRA_CTRL register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RRM_CMD_REQ</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQUENCER_CTRL</name>
          <description>(@ 0x00000008) SEQUENCER_CTRL register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GEN_SEQ_TRIGGER</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DISABLE_SEQ</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ABSOLUTE_TIME</name>
          <description>(@ 0x0000000C) ABSOLUTE_TIME register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ABSOLUTE_TIME</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCM_COUNTER_VAL</name>
          <description>(@ 0x00000010) SCM_COUNTER_VAL register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCM_COUNTER_CURRVAL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCM_MIN_MAX</name>
          <description>(@ 0x00000014) SCM_MIN_MAX register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SCM_COUNTER_MINVAL</name>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
            <field>
              <name>SCM_COUNTER_MAXVAL</name>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
            <field>
              <name>CLEAR_MIN_MAX</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEUP_IRQ_STATUS</name>
          <description>(@ 0x00000018) WAKEUP_IRQ_STATUS register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CPU_WAKEUP_F</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFIP_WAKEUP_F</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>MR_SUBG_GLOB_RETAINED</name>
      <description>MR_SUBG Global Retained</description>
      <groupName>MR_SUBG_GLOB_RETAINED</groupName>
      <baseAddress>0x49000780</baseAddress>
      <registers>
        <register>
          <name>RFIP_WAKEUPTIME</name>
          <description>(@ 0x00000000) RFIP_WAKEUPTIME register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RFIP_WAKEUPTIME</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_WAKEUPTIME</name>
          <description>(@ 0x00000004) CPU_WAKEUPTIME register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CPU_WAKEUPTIME</name>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WAKEUP_CTRL</name>
          <description>(@ 0x00000008) WAKEUP_CTRL register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SOC_WAKEUP_OFFSET</name>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>CPU_WAKEUP_EN</name>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RFIP_WAKEUP_EN</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RRM_CMDLIST_PTR</name>
          <description>(@ 0x0000000C) RRM_CMDLIST_PTR register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CMDLIST_PTR_OFFSET</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>CMDLIST_PTR_VALID</name>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQ_GLOBALTABLE_PTR</name>
          <description>(@ 0x00000010) SEQ_GLOBALTABLE_PTR register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEQ_GLOBALTABLE_PTR</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
